tests/performance/results/report-20260525-230830/statistics.json
{
  "GET dashboard (after login)-0" : {
    "transaction" : "GET dashboard (after login)-0",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 298.5,
    "medianResTime" : 298.5,
    "minResTime" : 244.0,
    "maxResTime" : 353.0,
    "pct1ResTime" : 353.0,
    "pct2ResTime" : 353.0,
    "pct3ResTime" : 353.0,
    "throughput" : 2.1299254526091587,
    "receivedKBytesPerSec" : 5.241613418530352,
    "sentKBytesPerSec" : 1.7368044462193823
  },
  "Ruang Ujian" : {
    "transaction" : "Ruang Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 585.0,
    "medianResTime" : 585.0,
    "minResTime" : 566.0,
    "maxResTime" : 604.0,
    "pct1ResTime" : 604.0,
    "pct2ResTime" : 604.0,
    "pct3ResTime" : 604.0,
    "throughput" : 1.7271157167530224,
    "receivedKBytesPerSec" : 80.80675194300518,
    "sentKBytesPerSec" : 2.858005451208981
  },
  "Simpan soal 1" : {
    "transaction" : "Simpan soal 1",
    "sampleCount" : 2,
    "errorCount" : 1,
    "errorPct" : 50.0,
    "meanResTime" : 271.0,
    "medianResTime" : 271.0,
    "minResTime" : 249.0,
    "maxResTime" : 293.0,
    "pct1ResTime" : 293.0,
    "pct2ResTime" : 293.0,
    "pct3ResTime" : 293.0,
    "throughput" : 2.3391812865497075,
    "receivedKBytesPerSec" : 5.365953947368421,
    "sentKBytesPerSec" : 3.090734649122807
  },
  "Hasil Ujian" : {
    "transaction" : "Hasil Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 552.5,
    "medianResTime" : 552.5,
    "minResTime" : 459.0,
    "maxResTime" : 646.0,
    "pct1ResTime" : 646.0,
    "pct2ResTime" : 646.0,
    "pct3ResTime" : 646.0,
    "throughput" : 1.4958863126402393,
    "receivedKBytesPerSec" : 68.08181796933434,
    "sentKBytesPerSec" : 1.8559800392670158
  },
  "GET dashboard (after login)-1" : {
    "transaction" : "GET dashboard (after login)-1",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 367.5,
    "medianResTime" : 367.5,
    "minResTime" : 340.0,
    "maxResTime" : 395.0,
    "pct1ResTime" : 395.0,
    "pct2ResTime" : 395.0,
    "pct3ResTime" : 395.0,
    "throughput" : 1.834862385321101,
    "receivedKBytesPerSec" : 85.23957138761467,
    "sentKBytesPerSec" : 1.4890338302752293
  },
  "Ruang Ujian-1" : {
    "transaction" : "Ruang Ujian-1",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 324.5,
    "medianResTime" : 324.5,
    "minResTime" : 313.0,
    "maxResTime" : 336.0,
    "pct1ResTime" : 336.0,
    "pct2ResTime" : 336.0,
    "pct3ResTime" : 336.0,
    "throughput" : 2.2099447513812156,
    "receivedKBytesPerSec" : 97.78034357734806,
    "sentKBytesPerSec" : 1.826873273480663
  },
  "Masuk Ujian" : {
    "transaction" : "Masuk Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 590.0,
    "medianResTime" : 590.0,
    "minResTime" : 568.0,
    "maxResTime" : 612.0,
    "pct1ResTime" : 612.0,
    "pct2ResTime" : 612.0,
    "pct3ResTime" : 612.0,
    "throughput" : 1.7953321364452424,
    "receivedKBytesPerSec" : 83.99840103231597,
    "sentKBytesPerSec" : 2.9708889699281866
  },
  "Daftar Ujian" : {
    "transaction" : "Daftar Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 460.5,
    "medianResTime" : 460.5,
    "minResTime" : 354.0,
    "maxResTime" : 567.0,
    "pct1ResTime" : 567.0,
    "pct2ResTime" : 567.0,
    "pct3ResTime" : 567.0,
    "throughput" : 1.8744142455482662,
    "receivedKBytesPerSec" : 89.29735092549204,
    "sentKBytesPerSec" : 2.2945100164011247
  },
  "Ruang Ujian-0" : {
    "transaction" : "Ruang Ujian-0",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 259.5,
    "medianResTime" : 259.5,
    "minResTime" : 252.0,
    "maxResTime" : 267.0,
    "pct1ResTime" : 267.0,
    "pct2ResTime" : 267.0,
    "pct3ResTime" : 267.0,
    "throughput" : 2.4360535931790497,
    "receivedKBytesPerSec" : 6.191239722898904,
    "sentKBytesPerSec" : 2.0173568818514007
  },
  "Selesai Ujian" : {
    "transaction" : "Selesai Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 388.5,
    "medianResTime" : 388.5,
    "minResTime" : 253.0,
    "maxResTime" : 524.0,
    "pct1ResTime" : 524.0,
    "pct2ResTime" : 524.0,
    "pct3ResTime" : 524.0,
    "throughput" : 1.7699115044247788,
    "receivedKBytesPerSec" : 4.49823700221239,
    "sentKBytesPerSec" : 2.288440265486726
  },
  "Hasil Ujian-1" : {
    "transaction" : "Hasil Ujian-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 391.0,
    "medianResTime" : 391.0,
    "minResTime" : 391.0,
    "maxResTime" : 391.0,
    "pct1ResTime" : 391.0,
    "pct2ResTime" : 391.0,
    "pct3ResTime" : 391.0,
    "throughput" : 2.557544757033248,
    "receivedKBytesPerSec" : 110.29661524936061,
    "sentKBytesPerSec" : 2.110473945012788
  },
  "Daftar Ujian-1" : {
    "transaction" : "Daftar Ujian-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 325.0,
    "medianResTime" : 325.0,
    "minResTime" : 325.0,
    "maxResTime" : 325.0,
    "pct1ResTime" : 325.0,
    "pct2ResTime" : 325.0,
    "pct3ResTime" : 325.0,
    "throughput" : 3.076923076923077,
    "receivedKBytesPerSec" : 132.6953125,
    "sentKBytesPerSec" : 2.5390625
  },
  "Daftar Ujian-0" : {
    "transaction" : "Daftar Ujian-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 241.0,
    "medianResTime" : 241.0,
    "minResTime" : 241.0,
    "maxResTime" : 241.0,
    "pct1ResTime" : 241.0,
    "pct2ResTime" : 241.0,
    "pct3ResTime" : 241.0,
    "throughput" : 4.149377593360996,
    "receivedKBytesPerSec" : 10.51526841286307,
    "sentKBytesPerSec" : 3.3673171680497926
  },
  "Hasil Ujian-0" : {
    "transaction" : "Hasil Ujian-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 253.0,
    "medianResTime" : 253.0,
    "minResTime" : 253.0,
    "maxResTime" : 253.0,
    "pct1ResTime" : 253.0,
    "pct2ResTime" : 253.0,
    "pct3ResTime" : 253.0,
    "throughput" : 3.952569169960474,
    "receivedKBytesPerSec" : 10.016520503952568,
    "sentKBytesPerSec" : 3.2732213438735176
  },
  "Masuk Ujian-1" : {
    "transaction" : "Masuk Ujian-1",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 326.5,
    "medianResTime" : 326.5,
    "minResTime" : 311.0,
    "maxResTime" : 342.0,
    "pct1ResTime" : 342.0,
    "pct2ResTime" : 342.0,
    "pct3ResTime" : 342.0,
    "throughput" : 2.333722287047841,
    "receivedKBytesPerSec" : 103.25695558634773,
    "sentKBytesPerSec" : 1.929195230455076
  },
  "POST login" : {
    "transaction" : "POST login",
    "sampleCount" : 2,
    "errorCount" : 1,
    "errorPct" : 50.0,
    "meanResTime" : 607.5,
    "medianResTime" : 607.5,
    "minResTime" : 313.0,
    "maxResTime" : 902.0,
    "pct1ResTime" : 902.0,
    "pct2ResTime" : 902.0,
    "pct3ResTime" : 902.0,
    "throughput" : 2.2148394241417497,
    "receivedKBytesPerSec" : 5.223473837209302,
    "sentKBytesPerSec" : 2.921035783499446
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 36,
    "errorCount" : 2,
    "errorPct" : 5.5555553,
    "meanResTime" : 419.63888888888886,
    "medianResTime" : 341.0,
    "minResTime" : 241.0,
    "maxResTime" : 1013.0,
    "pct1ResTime" : 677.5000000000005,
    "pct2ResTime" : 918.6499999999999,
    "pct3ResTime" : 1013.0,
    "throughput" : 1.40597539543058,
    "receivedKBytesPerSec" : 37.231459614821325,
    "sentKBytesPerSec" : 1.5149781536809217
  },
  "Masuk Ujian-0" : {
    "transaction" : "Masuk Ujian-0",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 261.5,
    "medianResTime" : 261.5,
    "minResTime" : 255.0,
    "maxResTime" : 268.0,
    "pct1ResTime" : 268.0,
    "pct2ResTime" : 268.0,
    "pct3ResTime" : 268.0,
    "throughput" : 2.5974025974025974,
    "receivedKBytesPerSec" : 6.601308847402597,
    "sentKBytesPerSec" : 2.1509740259740258
  },
  "Mulai Ujian" : {
    "transaction" : "Mulai Ujian",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 297.0,
    "medianResTime" : 297.0,
    "minResTime" : 293.0,
    "maxResTime" : 301.0,
    "pct1ResTime" : 301.0,
    "pct2ResTime" : 301.0,
    "pct3ResTime" : 301.0,
    "throughput" : 2.3584905660377355,
    "receivedKBytesPerSec" : 5.9941129864386795,
    "sentKBytesPerSec" : 3.2083763266509435
  },
  "GET dashboard (after login)" : {
    "transaction" : "GET dashboard (after login)",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 669.0,
    "medianResTime" : 669.0,
    "minResTime" : 587.0,
    "maxResTime" : 751.0,
    "pct1ResTime" : 751.0,
    "pct2ResTime" : 751.0,
    "pct3ResTime" : 751.0,
    "throughput" : 1.4958863126402393,
    "receivedKBytesPerSec" : 73.17352865557218,
    "sentKBytesPerSec" : 2.4337369109947646
  },
  "GET login page" : {
    "transaction" : "GET login page",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 689.5,
    "medianResTime" : 689.5,
    "minResTime" : 366.0,
    "maxResTime" : 1013.0,
    "pct1ResTime" : 1013.0,
    "pct2ResTime" : 1013.0,
    "pct3ResTime" : 1013.0,
    "throughput" : 1.5003750937734435,
    "receivedKBytesPerSec" : 64.70514112903226,
    "sentKBytesPerSec" : 0.17875562640660164
  }
}